Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--geoserver_overview.tmx
Source language: en
Languages: ja

source: Web Service
ja: Web サービス

source: GeoServer is a web server that allows you to serve maps and data from a variety of formats to standard clients such as web browsers and desktop GIS programs. Data is published via standards based interfaces, such as WMS, WFS, WCS, WPS, Tile Caching and more. GeoServer comes with a browser-based management interface and connects to multiple data sources at the back end.
ja: GeoServer は、多様なフォーマットから地図とデータを Web ブラウザやデスクトップ GIS プログラム等の標準的なクライアントに配信する Web サーバです。データは WMS、WFS、WCS、WPS、タイルキャッシュなどの標準に基づくインターフェイス経由で配信されます。GeoServer は、ブラウザベースの管理インターフェイスを持ち、バックエンド側で複数のデータソースへ接続します。

source: Core Features
ja: 主な機能

source: **Serve data from a variety of data stores:**
ja: **様々なデータストアからデータを配信:**

source: Vector
ja: ベクタ

source: Shapefiles, External WFS
ja: シェープファイル、 外部WFS

source: Raster
ja: ラスタ

source: GeoTiff, JPG and PNG (with world file), image pyramid, GDAL formats, Image Mosaic, Oracle GeoRaster, NetCDF
ja: GeoTiff, JPG 及び PNG (ワールドファイル付き), image pyramid, GDAL formats, Image Mosaic, Oracle GeoRaster, NetCDF

source: **Data is served as safe and quick images using WMS and WMTS protocols:**
ja: **WMS 及び WMTS プロトコルを利用した、安全かつ迅速なデータ配信:**

source: As the data is served up as an image your data is completely safe and secure. Unless they redigitise your data there is no way to steal your data. The appearance of each map layer can be controlled using the SLD standard which allows features to be coloured and labeled. By combining these rules with OGC Filters scale dependent styling can be implemented allowing more detail to be added as a user zooms in. Label collision management, grouping and priorities are also implemented.
ja: データは画像の状態で保存し、完全に安全でセキュアに配信します。データを再入力しない限り、あなたのデータを盗み出すことはできないでしょう。それぞれの地図のレイヤは SLD を用いて表示を変更できます。SLD 標準により地物の色やラベル表示を設定できます。これに、縮尺によって変化する OGC フィルターにを合わせると、ユーザーが拡大表示すると、より詳細を表示するような実装が可能です。ラベルの描画衝突の管理、グループ化、優先順位も実装されています。

source: **Full vector data can be sent to a client using the WFS protocol:**
ja: **WFS プロトコルを利用した、クライアントへの全ベクタデータ送信:**

source: A WFS client can download vector data and use it for mapping, spatial analysis and other operations. Also if authorised the user can modify the data and send it back to the server to update the stored data using the WFS-T protocol. The data can be transmitted using GML (compressed) as well as other standard data formats like shapefile and json.
ja: WFS クライアントは、ベクタデータをダウンロードして地図表示や空間解析等の用途に使用できます。さらに WFS-T プロトコルを利用して、認証されたユーザがサーバのデータを編集、アップロードすることで更新できます。シェープファイルや JSON のような標準規格同様に、データは圧縮した GML で送受信を行います。

source: **Raster data values can be sent to a client using the WCS protocol:**
ja: **WCS プロトコルを利用した、クライアントへのラスタデータ値送信:**

source: A GIS client can request the actual raster data for use in spatial analysis. This allows a user to create applications which can model the process described by your data.
ja: GISクライアントはラスタの実データを要求して空間解析に使うことができます。この機能を使うと、あなたのデータで記述したプロセスをベースに、ユーザーが活用することができます。

source: **On the fly reprojection:**
ja: **オンザフライ投影変換:**

source: GeoServer supports the majority of the EPSG database of projections and can reproject to any of them on demand to allow clients with limited reprojection support to pass the load to the server.
ja: GeoServer は EPSG データベースの主な投影法をサポートしており、オンデマンドでそれらの投影法への再投影ができます。クライアント側で再投影を制限され手いる場合にはサーバ側でその処理を行うこともできます。

source: **Tiling Cache**
ja: **タイルキャッシュ**

source: `GeoWebCache <https://www.geowebcache.org>`_, which is integrated into GeoServer, tiles and caches map images from a variety of sources such as WMS. It implements various service interfaces (such as WMS-C, WMTS, TMS, Google Maps KML, Virtual Earth) in order to accelerate and optimize map image delivery. It can also recombine tiles to work with regular WMS clients.
ja: `GeoWebCache <https://www.geowebcache.org>`_ は GeoServer に統合されていて、 WMS などの様々なソースからタイル化して地図画像をキャッシュします。様々な (WMS-C, WMTS, TMS, Google Maps KML, Virtual Earth などの) サービスインターフェイスを実装し、地図画像配信を加速・最適化します。通常の WMS クライアントで動作するよう、タイルを再結合することも可能です。

source: Geospatial algorithms, including those from :doc:`JTS <jts_overview>`, can be called through GeoServer's |WPS| interface. This includes the chaining of processes, and using rendering transformations to create powerful visualisations through the WMS interface.
ja: :doc:`JTS <jts_overview>` に由来する地理空間アルゴリズムを、 GeoServer の |WPS| インターフェイスを経由して呼び出すことが可能です。処理を連結することや、 WMS インターフェイスを経由して強力な可視化を行うためにレンダリングの変換を行うことも可能です。

source: Implemented Standards
ja: 準拠している標準規格

source: Support of numerous Open Geospatial Consortium (OGC) standards:
ja: 多くの Open Geospatial Consortium (OGC) 標準をサポートしています:

source: |WMS| (client/server)
ja: |WMS| (クライアントサーバー)

source: |WFS| (transactional)
ja: |WFS| (トランザクション)

source: Details
ja: 詳細

source: **Website:** http://geoserver.org/
ja: **Webサイト:** http://geoserver.org/

source: **Licence:** GNU General Public License (GPL) version 2
ja: **ライセンス:** GNU General Public License (GPL) version 2

source: **Software Version:** |version-geoserver|
ja: **ソフトウェアバージョン:** |version-geoserver|

source: **Supported Platforms:** Java 8 (Oracle JDK and OpenJDK) on Windows, Linux, and Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac 上の Java 8 (Oracle JDK 及び OpenJDK)

source: **API Interfaces:** WMS, WFS, WCS, REST
ja: **API インターフェイス:** WMS, WFS, WCS, REST

source: **Support:** http://geoserver.org/support/
ja: **サポート:** http://geoserver.org/support/

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/geoserver_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/geoserver_quickstart>`
